RhinoInside.Revit API Documentation
GeometryEncoder.ToXYZ Method (Point3d)
 Converts the specified Point3d to an equivalent XYZ point.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8021
Syntax
public static Autodesk.Revit.DB.XYZ ToXYZ(
	this Rhino.Geometry.Point3d value
)
@staticmethod
def ToXYZ(
	value: Rhino.Geometry.Point3d
) -> Autodesk.Revit.DB.XYZ
Parameters
value
Type: Rhino.Geometry.Point3d
A value to convert.
Return Value
Type: Autodesk.Revit.DB.XYZ
A Revit XYZ that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Point3d. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
ToXYZ Overload
RhinoInside.Revit.Convert.Geometry Namespace